
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       BE—Basic Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user network perpetual
Serial number: 501806221992
  Licensed to: Nathaniel Baum−Snow
               University of Toronto

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.

. do table_5.do 

. 
. // Table 5 - Shapley values
. // -------------------------------------
. 
. // Load data
. // -------------------------------------
. clear all

. set more off

. 
. cd ..
/global/home/pc_mzoican/kpz_etfliquidity

. local directory : pwd

. display "`working_dir'"


. import delimited "`directory'/data/etf_panel_processed.csv"
(encoding automatically selected: ISO-8859-1)
(94 vars, 1,752 obs)

. //import delimited "D:/ResearchProjects/kpz_etfliquidity/data/etf_panel_proce
> ssed.csv"
. 
. 
. 
. gen qspread_bps=10000*quotedspread_percent_tw 

. gen qspread_dollar=100*quotedspread_dollar_tw 

. 
. gen efspread_dollar=100*effectivespread_dollar_ave

. gen efspread_bps=10000*effectivespread_percent_ave

. 
. gen rspread_dollar=100*dollarrealizedspread_lr_ave

. gen rspread_bps=10000*percentrealizedspread_lr_ave

. 
. 
. drop net_expenses

. gen  net_expenses=other_expense-marketing_fee_bps/100+fee_waiver

. 
. gen mer_diff=(mer_bps-mer_avg_ix)

. 
. // List of variables to regress on index_id and quarter
. local varlist mkt_share mer_bps mer_diff stock_tweets marketing_fee_bps net_e
> xpenses ratio_tii lend_byaum_bps tr_error_bps perf_drag_bps d_uit turnover_fr
> ac qspread_bps qspread_dollar efspread_bps efspread_dollar rspread_bps rsprea
> d_dollar

. 
. // Loop through the list of variables
. foreach var in `varlist' {
  2.     // Perform the regression and save residuals
.     quietly reghdfe `var', absorb(index_id quarter) resid
  3.     predict `var'_resid, residuals
  4. }
(49 missing values generated)
(2 missing values generated)

. 
. 
. label variable mgr_duration "Investor holding duration"

. label variable highfee "High MER"

. label variable time_existence "ETF age (quarters)"

. label variable time_since_first "Time since first position"

. label variable log_aum_index "Log index AUM"

. label variable d_uit_resid "Unit investment trust"

. label variable lend_byaum_bps_resid "Lending income (bps of AUM)"

. label variable marketing_fee_bps_resid "Marketing expense (bps)"

. label variable stock_tweets_resid "Name recognition (Twitter msg.)"

. label variable tr_error_bps_resid "Tracking error (bps)"

. label variable perf_drag_bps_resid "Performance drag (bps)"

. label variable turnover_frac_resid "ETF turnover"

. label variable net_expenses_resid "Other net expenses"

. label variable log_volume "Log volume"

. label variable spread_bps_crsp "Relative spread"

. label variable creation_fee "Creation fee"

. label variable ratio_tii_resid "Tax-insensitive investors (TII)"

. 
. 
. label variable qspread_bps_resid "Quoted spread (bps)"

. label variable qspread_dollar_resid "Quoted spread (cents)"

. label variable efspread_bps_resid "Effective spread (bps)"

. label variable efspread_dollar_resid "Effective spread (cents)"

. label variable rspread_bps_resid "Realized spread (bps)"

. label variable rspread_dollar_resid "Realized spread (cents)"

. 
. rego mkt_share_resid   qspread_bps_resid \ stock_tweets_resid marketing_fee_b
> ps_resid net_expenses_resid  \ ratio_tii_resid \ lend_byaum_bps_resid  tr_err
> or_bps_resid perf_drag_bps_resid d_uit_resid, vce(cl index_id)
 
------------------------------------------------------------------------------
Gr        Regressor |       Coef.      Std.Err.   P>|t|  Std.Coef.   Group %R2
--------------------+---------------------------------------------------------
 1 qspread_bps_re~d |   -.0266091 ***  .0049837   0.000    -0.4760     67.6503
 2 stock_tweets_r~d |     .016636       .015282   0.282     0.0466     19.9582
   marketing_fee_~d |   -.0038134      .0103914   0.715    -0.0648           
   net_expenses_r~d |     .683968      1.025706   0.508     0.1317           
 3  ratio_tii_resid |    .0003663      .0010931   0.739     0.0158      0.7590
 4 lend_byaum_bps~d |     .010476 **   .0046921   0.030     0.1172     11.6326
   tr_error_bps_r~d |   -.0008368      .0008367   0.322    -0.0586           
   perf_drag_bps_~d |    -.002515      .0018263   0.175    -0.0378           
        d_uit_resid |   -.2059587        .27301   0.454    -0.0663           
 -        Intercept |    .0007117      .0021095   0.737     
--------------------+---------------------------------------------------------
       Observations |        1703
         Overall R2 |     0.35567
           Root MSE |    .2709454
      F-stat. Model |    32.61804 ***             0.000
     Log Likelihood |   -187.5954
------------------------------------------------------------------------------

. outreg2 using "`directory'/output/table_5.tex", adjr2 replace tex tstat label
>   dec(2) tdec(2) eqdrop(/) keep(*)
/global/home/pc_mzoican/kpz_etfliquidity/output/table_5.tex
dir : seeout

. 
. rego mkt_share_resid   efspread_bps_resid \ stock_tweets_resid marketing_fee_
> bps_resid net_expenses_resid  \ ratio_tii_resid \ lend_byaum_bps_resid  tr_er
> ror_bps_resid perf_drag_bps_resid d_uit_resid, vce(cl index_id)
 
------------------------------------------------------------------------------
Gr        Regressor |       Coef.      Std.Err.   P>|t|  Std.Coef.   Group %R2
--------------------+---------------------------------------------------------
 1 efspread_bps_r~d |   -.0344444 ***  .0074745   0.000    -0.4458     64.8489
 2 stock_tweets_r~d |    .0200136      .0161768   0.222     0.0561     22.2872
   marketing_fee_~d |   -.0000132      .0107597   0.999    -0.0002           
   net_expenses_r~d |    1.093616      1.026807   0.292     0.2106           
 3  ratio_tii_resid |    .0002862      .0010972   0.795     0.0124      0.8125
 4 lend_byaum_bps~d |    .0095002 *    .0053473   0.082     0.1063     12.0514
   tr_error_bps_r~d |   -.0006737      .0008674   0.441    -0.0472           
   perf_drag_bps_~d |   -.0018029      .0018187   0.327    -0.0271           
        d_uit_resid |   -.2560588      .2870716   0.377    -0.0825           
 -        Intercept |    .0000957      .0022571   0.966     
--------------------+---------------------------------------------------------
       Observations |        1703
         Overall R2 |     0.33330
           Root MSE |     .275608
      F-stat. Model |    20.42436 ***             0.000
     Log Likelihood |   -216.6524
------------------------------------------------------------------------------

. outreg2 using "`directory'/output/table_5.tex", adjr2 append tex tstat label 
>  dec(2) tdec(2) eqdrop(/) keep(*)
/global/home/pc_mzoican/kpz_etfliquidity/output/table_5.tex
dir : seeout

. 
. rego mkt_share_resid   rspread_bps_resid \ stock_tweets_resid marketing_fee_b
> ps_resid net_expenses_resid  \ ratio_tii_resid \ lend_byaum_bps_resid  tr_err
> or_bps_resid perf_drag_bps_resid d_uit_resid, vce(cl index_id)
 
------------------------------------------------------------------------------
Gr        Regressor |       Coef.      Std.Err.   P>|t|  Std.Coef.   Group %R2
--------------------+---------------------------------------------------------
 1 rspread_bps_re~d |   -.0320424 ***  .0084078   0.000    -0.4101     61.4031
 2 stock_tweets_r~d |    .0217855      .0160772   0.182     0.0610     24.4004
   marketing_fee_~d |   -.0005718      .0110054   0.959    -0.0097           
   net_expenses_r~d |    1.114125      1.045415   0.292     0.2145           
 3  ratio_tii_resid |      .00026      .0010955   0.813     0.0112      0.8758
 4 lend_byaum_bps~d |    .0111165 *    .0056491   0.055     0.1244     13.3208
   tr_error_bps_r~d |   -.0003665      .0008665   0.674    -0.0257           
   perf_drag_bps_~d |   -.0018314      .0017952   0.313    -0.0275           
        d_uit_resid |   -.2667498      .2860263   0.356    -0.0859           
 -        Intercept |    .0005046      .0019833   0.800     
--------------------+---------------------------------------------------------
       Observations |        1703
         Overall R2 |     0.31483
           Root MSE |    .2793996
      F-stat. Model |    25.33341 ***             0.000
     Log Likelihood |   -239.9214
------------------------------------------------------------------------------

. outreg2 using "`directory'/output/table_5.tex", adjr2 append tex tstat label 
>  dec(2) tdec(2) eqdrop(/) keep(*)
/global/home/pc_mzoican/kpz_etfliquidity/output/table_5.tex
dir : seeout

. 
. rego mkt_share_resid    turnover_frac_resid  \ stock_tweets_resid marketing_f
> ee_bps_resid net_expenses_resid  \ ratio_tii_resid \ lend_byaum_bps_resid  tr
> _error_bps_resid perf_drag_bps_resid d_uit_resid, vce(cl index_id)
 
------------------------------------------------------------------------------
Gr        Regressor |       Coef.      Std.Err.   P>|t|  Std.Coef.   Group %R2
--------------------+---------------------------------------------------------
 1 turnover_frac_~d |    .0203699 ***  .0038984   0.000     0.4126     44.5939
 2 stock_tweets_r~d |   -.0098387      .0125288   0.436    -0.0276     33.4578
   marketing_fee_~d |   -.0133206      .0124165   0.289    -0.2266           
   net_expenses_r~d |    .5086444      1.216322   0.678     0.0981           
 3  ratio_tii_resid |   -.0013365      .0011415   0.247    -0.0577      1.0146
 4 lend_byaum_bps~d |    .0192067 ***  .0054026   0.001     0.2147     20.9337
   tr_error_bps_r~d |   -.0012057      .0009267   0.199    -0.0845           
   perf_drag_bps_~d |   -.0014532      .0020739   0.487    -0.0217           
        d_uit_resid |   -.3455713 *    .1994402   0.090    -0.1114           
 -        Intercept |    .0034777 **   .0014206   0.018     
--------------------+---------------------------------------------------------
       Observations |        1701
         Overall R2 |     0.30264
           Root MSE |    .2816692
      F-stat. Model |    32.20886 ***             0.000
     Log Likelihood |   -253.3951
------------------------------------------------------------------------------

. outreg2 using "`directory'/output/table_5.tex", adjr2 append tex tstat label 
>  dec(2) tdec(2) eqdrop(/) keep(*)
/global/home/pc_mzoican/kpz_etfliquidity/output/table_5.tex
dir : seeout

. 
. rego mer_bps_resid   qspread_bps_resid \ stock_tweets_resid marketing_fee_bps
> _resid net_expenses_resid  \ ratio_tii_resid \ lend_byaum_bps_resid  tr_error
> _bps_resid perf_drag_bps_resid d_uit_resid, vce(cl index_id)
 
------------------------------------------------------------------------------
Gr        Regressor |       Coef.      Std.Err.   P>|t|  Std.Coef.   Group %R2
--------------------+---------------------------------------------------------
 1 qspread_bps_re~d |   -.4112932 ***  .1068262   0.000    -0.2604     29.9117
 2 stock_tweets_r~d |   -.2879249      .2178048   0.192    -0.0286     27.9870
   marketing_fee_~d |   -.1948423      .2599853   0.457    -0.1172           
   net_expenses_r~d |    20.97493      26.50029   0.433     0.1430           
 3  ratio_tii_resid |    .0223999      .0240892   0.357     0.0342      1.9185
 4 lend_byaum_bps~d |    .1085796      .3043346   0.723     0.0430     40.1828
   tr_error_bps_r~d |    .1419423 ***  .0520621   0.009     0.3518           
   perf_drag_bps_~d |    .2862359 **   .1333107   0.037     0.1521           
        d_uit_resid |    10.10898 **   4.495764   0.029     0.1152           
 -        Intercept |    .0093686      .0386199   0.809     
--------------------+---------------------------------------------------------
       Observations |        1703
         Overall R2 |     0.38647
           Root MSE |    7.468432
      F-stat. Model |    29.15869 ***             0.000
     Log Likelihood |   -5835.634
------------------------------------------------------------------------------

. outreg2 using "`directory'/output/table_5.tex", adjr2 append tex tstat label 
>  dec(2) tdec(2) eqdrop(/) keep(*)
/global/home/pc_mzoican/kpz_etfliquidity/output/table_5.tex
dir : seeout

. 
. rego mer_bps_resid   efspread_bps_resid \ stock_tweets_resid marketing_fee_bp
> s_resid net_expenses_resid  \ ratio_tii_resid \ lend_byaum_bps_resid  tr_erro
> r_bps_resid perf_drag_bps_resid d_uit_resid, vce(cl index_id)
 
------------------------------------------------------------------------------
Gr        Regressor |       Coef.      Std.Err.   P>|t|  Std.Coef.   Group %R2
--------------------+---------------------------------------------------------
 1 efspread_bps_r~d |   -.5268934 ***  .1508004   0.001    -0.2414     27.4444
 2 stock_tweets_r~d |   -.2352841      .2047799   0.256    -0.0233     29.2206
   marketing_fee_~d |   -.1364976      .2663516   0.611    -0.0821           
   net_expenses_r~d |    27.38466      27.04906   0.316     0.1867           
 3  ratio_tii_resid |    .0210998        .02335   0.371     0.0322      1.9598
 4 lend_byaum_bps~d |    .0952074      .3184838   0.766     0.0377     41.3752
   tr_error_bps_r~d |     .144674 ***  .0526947   0.008     0.3585           
   perf_drag_bps_~d |    .2974002 **    .130833   0.028     0.1581           
        d_uit_resid |    9.329917 **   4.363709   0.038     0.1064           
 -        Intercept |    .0003459      .0428253   0.994     
--------------------+---------------------------------------------------------
       Observations |        1703
         Overall R2 |     0.37882
           Root MSE |    7.514855
      F-stat. Model |    26.98947 ***             0.000
     Log Likelihood |   -5846.187
------------------------------------------------------------------------------

. outreg2 using "`directory'/output/table_5.tex", adjr2 append tex tstat label 
>  dec(2) tdec(2) eqdrop(/) keep(*)
/global/home/pc_mzoican/kpz_etfliquidity/output/table_5.tex
dir : seeout

. 
. rego mer_bps_resid   rspread_bps_resid \ stock_tweets_resid marketing_fee_bps
> _resid net_expenses_resid  \ ratio_tii_resid \ lend_byaum_bps_resid  tr_error
> _bps_resid perf_drag_bps_resid d_uit_resid, vce(cl index_id)
 
------------------------------------------------------------------------------
Gr        Regressor |       Coef.      Std.Err.   P>|t|  Std.Coef.   Group %R2
--------------------+---------------------------------------------------------
 1 rspread_bps_re~d |   -.5358679 ***  .1200441   0.000    -0.2428     26.7082
 2 stock_tweets_r~d |   -.2095149      .2061282   0.315    -0.0208     29.2825
   marketing_fee_~d |   -.1423226      .2675721   0.597    -0.0856           
   net_expenses_r~d |    27.03331      27.44655   0.330     0.1843           
 3  ratio_tii_resid |    .0212061      .0234339   0.370     0.0324      1.9642
 4 lend_byaum_bps~d |    .1069818      .3129617   0.734     0.0424     42.0451
   tr_error_bps_r~d |    .1479323 ***  .0507713   0.005     0.3666           
   perf_drag_bps_~d |    .2955108 **   .1292729   0.027     0.1571           
        d_uit_resid |    9.192807 **   4.412327   0.043     0.1048           
 -        Intercept |    .0027401       .039239   0.945     
--------------------+---------------------------------------------------------
       Observations |        1703
         Overall R2 |     0.38120
           Root MSE |    7.500413
      F-stat. Model |    27.97505 ***             0.000
     Log Likelihood |   -5842.911
------------------------------------------------------------------------------

. outreg2 using "`directory'/output/table_5.tex", adjr2 append tex tstat label 
>  dec(2) tdec(2) eqdrop(/) keep(*)
/global/home/pc_mzoican/kpz_etfliquidity/output/table_5.tex
dir : seeout

. 
. rego mer_bps_resid    turnover_frac_resid  \ stock_tweets_resid marketing_fee
> _bps_resid net_expenses_resid  \ ratio_tii_resid \ lend_byaum_bps_resid  tr_e
> rror_bps_resid perf_drag_bps_resid d_uit_resid, vce(cl index_id)
 
------------------------------------------------------------------------------
Gr        Regressor |       Coef.      Std.Err.   P>|t|  Std.Coef.   Group %R2
--------------------+---------------------------------------------------------
 1 turnover_frac_~d |     .318892 *    .1603795   0.052     0.2286     21.3598
 2 stock_tweets_r~d |   -.7054114 *    .4183024   0.098    -0.0700     35.8885
   marketing_fee_~d |   -.3432989      .3318204   0.306    -0.2067           
   net_expenses_r~d |    18.20415      34.21657   0.597     0.1242           
 3  ratio_tii_resid |   -.0031735      .0244938   0.897    -0.0049      1.6806
 4 lend_byaum_bps~d |    .2413485      .2840274   0.400     0.0955     41.0711
   tr_error_bps_r~d |    .1343962 ***  .0369815   0.001     0.3334           
   perf_drag_bps_~d |    .2904136 **   .1170064   0.017     0.1537           
        d_uit_resid |    7.933541      5.648611   0.167     0.0905           
 -        Intercept |     .036506      .0268917   0.181     
--------------------+---------------------------------------------------------
       Observations |        1701
         Overall R2 |     0.37067
           Root MSE |    7.560597
      F-stat. Model |    26.85213 ***             0.000
     Log Likelihood |   -5849.638
------------------------------------------------------------------------------

. outreg2 using "`directory'/output/table_5.tex", adjr2 append tex tstat label 
>  dec(2) tdec(2) eqdrop(/) keep(*)
/global/home/pc_mzoican/kpz_etfliquidity/output/table_5.tex
dir : seeout

. 
. 
. // Robustness table with dollar measures
. 
. rego mkt_share_resid   qspread_dollar_resid \ stock_tweets_resid marketing_fe
> e_bps_resid net_expenses_resid  \ ratio_tii_resid \ lend_byaum_bps_resid  tr_
> error_bps_resid perf_drag_bps_resid d_uit_resid, vce(cl index_id)
 
------------------------------------------------------------------------------
Gr        Regressor |       Coef.      Std.Err.   P>|t|  Std.Coef.   Group %R2
--------------------+---------------------------------------------------------
 1 qspread_dollar~d |   -.0398926 ***  .0075272   0.000    -0.4260     48.7469
 2 stock_tweets_r~d |    .0083458      .0119691   0.489     0.0234     34.7766
   marketing_fee_~d |   -.0171823      .0112952   0.135    -0.2919           
   net_expenses_r~d |    .4175455       1.05413   0.694     0.0804           
 3  ratio_tii_resid |   -3.33e-06      .0011205   0.998    -0.0001      0.9140
 4 lend_byaum_bps~d |    .0170096 ***  .0050771   0.002     0.1903     15.5625
   tr_error_bps_r~d |   -.0003523      .0008392   0.677    -0.0247           
   perf_drag_bps_~d |   -.0015203      .0019644   0.443    -0.0228           
        d_uit_resid |   -.1077682      .2210285   0.628    -0.0347           
 -        Intercept |    .0026189      .0016769   0.125     
--------------------+---------------------------------------------------------
       Observations |        1703
         Overall R2 |     0.33870
           Root MSE |    .2744906
      F-stat. Model |    39.52127 ***             0.000
     Log Likelihood |    -209.734
------------------------------------------------------------------------------

. outreg2 using "`directory'/output/table_5_dollar.tex", adjr2 replace tex tsta
> t label  dec(2) tdec(2) eqdrop(/) keep(*)
/global/home/pc_mzoican/kpz_etfliquidity/output/table_5_dollar.tex
dir : seeout

. 
. rego mkt_share_resid   efspread_dollar_resid \ stock_tweets_resid marketing_f
> ee_bps_resid net_expenses_resid  \ ratio_tii_resid \ lend_byaum_bps_resid  tr
> _error_bps_resid perf_drag_bps_resid d_uit_resid, vce(cl index_id)
 
------------------------------------------------------------------------------
Gr        Regressor |       Coef.      Std.Err.   P>|t|  Std.Coef.   Group %R2
--------------------+---------------------------------------------------------
 1 efspread_dolla~d |   -.0602406 ***  .0124858   0.000    -0.4252     50.3321
 2 stock_tweets_r~d |    .0127979      .0136727   0.354     0.0358     34.3295
   marketing_fee_~d |   -.0134331      .0112988   0.240    -0.2282           
   net_expenses_r~d |    .7694036       1.04777   0.466     0.1481           
 3  ratio_tii_resid |    .0002165       .001109   0.846     0.0093      1.0043
 4 lend_byaum_bps~d |    .0151082 ***  .0054917   0.008     0.1690     14.3342
   tr_error_bps_r~d |   -.0004855      .0008662   0.578    -0.0340           
   perf_drag_bps_~d |   -.0016124      .0019599   0.415    -0.0242           
        d_uit_resid |   -.1689214      .2488535   0.501    -0.0544           
 -        Intercept |    .0016847      .0016493   0.312     
--------------------+---------------------------------------------------------
       Observations |        1703
         Overall R2 |     0.34239
           Root MSE |    .2737238
      F-stat. Model |    42.34795 ***             0.000
     Log Likelihood |     -204.97
------------------------------------------------------------------------------

. outreg2 using "`directory'/output/table_5_dollar.tex", adjr2 append tex tstat
>  label  dec(2) tdec(2) eqdrop(/) keep(*)
/global/home/pc_mzoican/kpz_etfliquidity/output/table_5_dollar.tex
dir : seeout

. 
. rego mkt_share_resid   rspread_dollar_resid \ stock_tweets_resid marketing_fe
> e_bps_resid net_expenses_resid  \ ratio_tii_resid \ lend_byaum_bps_resid  tr_
> error_bps_resid perf_drag_bps_resid d_uit_resid, vce(cl index_id)
 
------------------------------------------------------------------------------
Gr        Regressor |       Coef.      Std.Err.   P>|t|  Std.Coef.   Group %R2
--------------------+---------------------------------------------------------
 1 rspread_dollar~d |   -.0736888 ***  .0132851   0.000    -0.4549     55.8306
 2 stock_tweets_r~d |    .0197457      .0154068   0.206     0.0553     30.1817
   marketing_fee_~d |   -.0118327       .010907   0.283    -0.2010           
   net_expenses_r~d |    .8019482      1.003855   0.428     0.1544           
 3  ratio_tii_resid |    .0003975      .0010713   0.712     0.0172      0.9939
 4 lend_byaum_bps~d |    .0138767 **   .0055432   0.016     0.1552     12.9938
   tr_error_bps_r~d |   -.0003643      .0008395   0.666    -0.0255           
   perf_drag_bps_~d |   -.0017386      .0019069   0.366    -0.0261           
        d_uit_resid |   -.2669301      .2783553   0.342    -0.0860           
 -        Intercept |    .0011799      .0015769   0.458     
--------------------+---------------------------------------------------------
       Observations |        1703
         Overall R2 |     0.36946
           Root MSE |    .2680311
      F-stat. Model |    47.61147 ***             0.000
     Log Likelihood |   -169.1787
------------------------------------------------------------------------------

. outreg2 using "`directory'/output/table_5_dollar.tex", adjr2 append tex tstat
>  label  dec(2) tdec(2) eqdrop(/) keep(*)
/global/home/pc_mzoican/kpz_etfliquidity/output/table_5_dollar.tex
dir : seeout

. 
. rego mer_bps_resid   qspread_dollar_resid \ stock_tweets_resid marketing_fee_
> bps_resid net_expenses_resid  \ ratio_tii_resid \ lend_byaum_bps_resid  tr_er
> ror_bps_resid perf_drag_bps_resid d_uit_resid, vce(cl index_id)
 
------------------------------------------------------------------------------
Gr        Regressor |       Coef.      Std.Err.   P>|t|  Std.Coef.   Group %R2
--------------------+---------------------------------------------------------
 1 qspread_dollar~d |   -.3222434 *    .1670769   0.060    -0.1218      5.5204
 2 stock_tweets_r~d |   -.3099871      .2460888   0.214    -0.0307     40.7104
   marketing_fee_~d |   -.2929778      .2982047   0.331    -0.1762           
   net_expenses_r~d |    25.43658      27.82962   0.365     0.1734           
 3  ratio_tii_resid |    .0160108      .0253767   0.531     0.0245      2.2543
 4 lend_byaum_bps~d |    .2330664      .2941491   0.432     0.0923     51.5149
   tr_error_bps_r~d |    .1567764 ***  .0492666   0.003     0.3885           
   perf_drag_bps_~d |    .3068337 **   .1324415   0.025     0.1631           
        d_uit_resid |    10.31687 **    4.88359   0.040     0.1176           
 -        Intercept |    .0432103      .0305218   0.163     
--------------------+---------------------------------------------------------
       Observations |        1703
         Overall R2 |     0.34654
           Root MSE |     7.70764
      F-stat. Model |    27.45908 ***             0.000
     Log Likelihood |   -5889.325
------------------------------------------------------------------------------

. outreg2 using "`directory'/output/table_5_dollar.tex", adjr2 append tex tstat
>  label  dec(2) tdec(2) eqdrop(/) keep(*)
/global/home/pc_mzoican/kpz_etfliquidity/output/table_5_dollar.tex
dir : seeout

. 
. rego mer_bps_resid   efspread_dollar_resid \ stock_tweets_resid marketing_fee
> _bps_resid net_expenses_resid  \ ratio_tii_resid \ lend_byaum_bps_resid  tr_e
> rror_bps_resid perf_drag_bps_resid d_uit_resid, vce(cl index_id)
 
------------------------------------------------------------------------------
Gr        Regressor |       Coef.      Std.Err.   P>|t|  Std.Coef.   Group %R2
--------------------+---------------------------------------------------------
 1 efspread_dolla~d |   -.4492256 *    .2578272   0.088    -0.1122      5.5119
 2 stock_tweets_r~d |   -.2678652      .2276442   0.245    -0.0266     40.9678
   marketing_fee_~d |   -.2558944      .2909498   0.384    -0.1539           
   net_expenses_r~d |      28.782      27.79987   0.306     0.1962           
 3  ratio_tii_resid |    .0175932      .0249645   0.484     0.0269      2.3212
 4 lend_byaum_bps~d |    .2208632      .3021394   0.468     0.0875     51.1991
   tr_error_bps_r~d |    .1564004 ***  .0501941   0.003     0.3876           
   perf_drag_bps_~d |    .3065863 **   .1325736   0.025     0.1630           
        d_uit_resid |    9.750688 **   4.624542   0.040     0.1112           
 -        Intercept |    .0366104      .0304911   0.236     
--------------------+---------------------------------------------------------
       Observations |        1703
         Overall R2 |     0.34486
           Root MSE |    7.717527
      F-stat. Model |    22.76111 ***             0.000
     Log Likelihood |   -5891.508
------------------------------------------------------------------------------

. outreg2 using "`directory'/output/table_5_dollar.tex", adjr2 append tex tstat
>  label  dec(2) tdec(2) eqdrop(/) keep(*)
/global/home/pc_mzoican/kpz_etfliquidity/output/table_5_dollar.tex
dir : seeout

. 
. rego mer_bps_resid   rspread_dollar_resid \ stock_tweets_resid marketing_fee_
> bps_resid net_expenses_resid  \ ratio_tii_resid \ lend_byaum_bps_resid  tr_er
> ror_bps_resid perf_drag_bps_resid d_uit_resid, vce(cl index_id)
 
------------------------------------------------------------------------------
Gr        Regressor |       Coef.      Std.Err.   P>|t|  Std.Coef.   Group %R2
--------------------+---------------------------------------------------------
 1 rspread_dollar~d |   -.5932166 **    .290739   0.047    -0.1296      7.5425
 2 stock_tweets_r~d |   -.2178195      .2118554   0.309    -0.0216     39.9044
   marketing_fee_~d |   -.2495082      .2891762   0.393    -0.1501           
   net_expenses_r~d |    28.56308      28.03921   0.313     0.1947           
 3  ratio_tii_resid |    .0192352      .0246331   0.439     0.0294      2.3381
 4 lend_byaum_bps~d |    .2079329      .3035779   0.497     0.0823     50.2150
   tr_error_bps_r~d |    .1567069 ***  .0493941   0.003     0.3884           
   perf_drag_bps_~d |    .3050953 **   .1317174   0.025     0.1622           
        d_uit_resid |    9.030698 **   4.445335   0.048     0.1029           
 -        Intercept |    .0316421      .0305933   0.306     
--------------------+---------------------------------------------------------
       Observations |        1703
         Overall R2 |     0.34895
           Root MSE |    7.693418
      F-stat. Model |    23.35203 ***             0.000
     Log Likelihood |    -5886.18
------------------------------------------------------------------------------

. outreg2 using "`directory'/output/table_5_dollar.tex", adjr2 append tex tstat
>  label  dec(2) tdec(2) eqdrop(/) keep(*)
/global/home/pc_mzoican/kpz_etfliquidity/output/table_5_dollar.tex
dir : seeout

. 
. 
. 
end of do-file
