
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: Single-user 8-core  perpetual
Serial number: 501806221785
  Licensed to: Marius Zoican
               University of Toronto

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do table_8.do 

. // Load data
. // -------------------------------------
. clear all

. set more off

. 
. cd ..
D:\Research\kpz_etfliquidity

. local directory : pwd

. display "`working_dir'"


. import delimited "`directory'/data/probit_data_processed.csv"
(encoding automatically selected: ISO-8859-1)
(12 vars, 1,071 obs)

. 
. gen log_aum=log(aum_index)
(3 missing values generated)

. egen spread_index_std=std(spread_index)
(2 missing values generated)

. egen ratio_tii_std=std(ratio_tii)
(37 missing values generated)

. egen ratio_tra_std=std(ratio_tra)
(51 missing values generated)

. gen major_brand_index=1-d_ownindex

. gen numhold_000=num_hold_index/1000
(2 missing values generated)

. 
. label variable competition "Competition"

. label variable log_aum "Log AUM index"

. label variable top3_issuer "Top-3 ETF issuer"

. label variable major_brand_index "Major brand index"

. label variable numhold_000 "Number constituents (000s)"

. label variable spread_index_std "Relative spread"

. label variable ratio_tii_std "Tax-insensitive investors (% AUM)"

. label variable ratio_tra_std "Transient investors (% AUM)"

. 
. probit competition log_aum, vce(robust)

Iteration 0:  Log pseudolikelihood = -242.18114  
Iteration 1:  Log pseudolikelihood = -162.49088  
Iteration 2:  Log pseudolikelihood =  -149.5217  
Iteration 3:  Log pseudolikelihood = -149.27789  
Iteration 4:  Log pseudolikelihood = -149.27718  
Iteration 5:  Log pseudolikelihood = -149.27718  

Probit regression                                       Number of obs =  1,068
                                                        Wald chi2(1)  =  63.29
                                                        Prob > chi2   = 0.0000
Log pseudolikelihood = -149.27718                       Pseudo R2     = 0.3836

------------------------------------------------------------------------------
             |               Robust
 competition | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     log_aum |   .4761385   .0598506     7.96   0.000     .3588334    .5934436
       _cons |  -11.31181   1.296537    -8.72   0.000    -13.85297   -8.770645
------------------------------------------------------------------------------

. outreg2 using "`directory'/output/table_8.tex", replace tex tstat e(r2_p)  la
> bel  dec(2) tdec(2) eqdrop(/) keep(*) 
D:\Research\kpz_etfliquidity/output/table_8.tex
dir : seeout

. 
. probit competition log_aum top3_issuer major_brand_index, vce(robust)

Iteration 0:  Log pseudolikelihood = -242.18114  
Iteration 1:  Log pseudolikelihood = -159.19561  
Iteration 2:  Log pseudolikelihood = -146.34907  
Iteration 3:  Log pseudolikelihood = -146.02463  
Iteration 4:  Log pseudolikelihood = -146.02333  
Iteration 5:  Log pseudolikelihood = -146.02333  

Probit regression                                       Number of obs =  1,068
                                                        Wald chi2(3)  =  85.97
                                                        Prob > chi2   = 0.0000
Log pseudolikelihood = -146.02333                       Pseudo R2     = 0.3970

------------------------------------------------------------------------------
             |               Robust
 competition | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     log_aum |   .4336753   .0608444     7.13   0.000     .3144225    .5529281
 top3_issuer |   .3746621   .1797546     2.08   0.037     .0223496    .7269745
major_bran~x |   .3155883    .169308     1.86   0.062    -.0162493    .6474258
       _cons |  -10.72479   1.274295    -8.42   0.000    -13.22237    -8.22722
------------------------------------------------------------------------------

. outreg2 using "`directory'/output/table_8.tex", append tex tstat e(r2_p)  lab
> el  dec(2) tdec(2) eqdrop(/) keep(*)
D:\Research\kpz_etfliquidity/output/table_8.tex
dir : seeout

. 
. probit competition log_aum top3_issuer major_brand_index numhold_000, vce(rob
> ust)

Iteration 0:  Log pseudolikelihood = -242.18114  
Iteration 1:  Log pseudolikelihood = -158.88588  
Iteration 2:  Log pseudolikelihood = -146.31645  
Iteration 3:  Log pseudolikelihood = -145.99527  
Iteration 4:  Log pseudolikelihood = -145.99394  
Iteration 5:  Log pseudolikelihood = -145.99394  

Probit regression                                       Number of obs =  1,068
                                                        Wald chi2(4)  =  90.34
                                                        Prob > chi2   = 0.0000
Log pseudolikelihood = -145.99394                       Pseudo R2     = 0.3972

------------------------------------------------------------------------------
             |               Robust
 competition | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     log_aum |   .4311767   .0627601     6.87   0.000     .3081693    .5541842
 top3_issuer |    .366596   .1832974     2.00   0.045     .0073398    .7258523
major_bran~x |   .3087228   .1701101     1.81   0.070     -.024687    .6421325
 numhold_000 |   .0292105   .1057413     0.28   0.782    -.1780387    .2364596
       _cons |  -10.67793   1.306371    -8.17   0.000    -13.23837   -8.117494
------------------------------------------------------------------------------

. outreg2 using "`directory'/output/table_8.tex", append tex tstat e(r2_p)  lab
> el  dec(2) tdec(2) eqdrop(/) keep(*)
D:\Research\kpz_etfliquidity/output/table_8.tex
dir : seeout

. 
. probit competition log_aum top3_issuer major_brand_index numhold_000 spread_i
> ndex_std, vce(robust)

Iteration 0:  Log pseudolikelihood = -242.18114  
Iteration 1:  Log pseudolikelihood = -156.04407  
Iteration 2:  Log pseudolikelihood = -143.50191  
Iteration 3:  Log pseudolikelihood = -143.24729  
Iteration 4:  Log pseudolikelihood = -143.24648  
Iteration 5:  Log pseudolikelihood = -143.24648  

Probit regression                                       Number of obs =  1,068
                                                        Wald chi2(5)  =  96.02
                                                        Prob > chi2   = 0.0000
Log pseudolikelihood = -143.24648                       Pseudo R2     = 0.4085

------------------------------------------------------------------------------
             |               Robust
 competition | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     log_aum |   .4962907   .0686224     7.23   0.000     .3617933    .6307881
 top3_issuer |   .3637482    .188334     1.93   0.053    -.0053796    .7328761
major_bran~x |   .3265141   .1723189     1.89   0.058    -.0112248     .664253
 numhold_000 |   .0094847   .1076905     0.09   0.930    -.2015849    .2205542
spread_ind~d |   .3380815   .0634767     5.33   0.000     .2136694    .4624935
       _cons |  -11.89558   1.408331    -8.45   0.000    -14.65586   -9.135303
------------------------------------------------------------------------------

. outreg2 using "`directory'/output/table_8.tex", append tex tstat e(r2_p) labe
> l  dec(2) tdec(2) eqdrop(/) keep(*)
D:\Research\kpz_etfliquidity/output/table_8.tex
dir : seeout

. 
. probit competition log_aum ratio_tra_std top3_issuer major_brand_index numhol
> d_000 spread_index_std , vce(robust)

Iteration 0:  Log pseudolikelihood = -239.07915  
Iteration 1:  Log pseudolikelihood = -151.32066  
Iteration 2:  Log pseudolikelihood = -137.47137  
Iteration 3:  Log pseudolikelihood = -137.18569  
Iteration 4:  Log pseudolikelihood = -137.18505  
Iteration 5:  Log pseudolikelihood = -137.18505  

Probit regression                                       Number of obs =  1,019
                                                        Wald chi2(6)  =  89.03
                                                        Prob > chi2   = 0.0000
Log pseudolikelihood = -137.18505                       Pseudo R2     = 0.4262

------------------------------------------------------------------------------
             |               Robust
 competition | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     log_aum |   .5638309    .089453     6.30   0.000     .3885063    .7391555
ratio_tra_~d |   .4303305   .1531051     2.81   0.005     .1302501     .730411
 top3_issuer |   .3420447   .1884375     1.82   0.069     -.027286    .7113754
major_bran~x |   .3673423   .1652754     2.22   0.026     .0434085    .6912762
 numhold_000 |   .0709074   .1089582     0.65   0.515    -.1426467    .2844614
spread_ind~d |   .2793587     .06253     4.47   0.000     .1568023    .4019152
       _cons |  -13.30233   1.849125    -7.19   0.000    -16.92654   -9.678107
------------------------------------------------------------------------------

. outreg2 using "`directory'/output/table_8.tex", append tex tstat e(r2_p)  lab
> el  dec(2) tdec(2) eqdrop(/) keep(*)
D:\Research\kpz_etfliquidity/output/table_8.tex
dir : seeout

. 
. probit competition log_aum ratio_tra_std ratio_tii_std top3_issuer major_bran
> d_index numhold_000 spread_index_std , vce(robust)

Iteration 0:  Log pseudolikelihood = -239.07915  
Iteration 1:  Log pseudolikelihood = -148.89378  
Iteration 2:  Log pseudolikelihood = -132.28135  
Iteration 3:  Log pseudolikelihood = -131.95737  
Iteration 4:  Log pseudolikelihood = -131.95686  
Iteration 5:  Log pseudolikelihood = -131.95686  

Probit regression                                       Number of obs =  1,019
                                                        Wald chi2(7)  = 112.46
                                                        Prob > chi2   = 0.0000
Log pseudolikelihood = -131.95686                       Pseudo R2     = 0.4481

------------------------------------------------------------------------------
             |               Robust
 competition | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     log_aum |   .5847301   .0816405     7.16   0.000     .4247177    .7447424
ratio_tra_~d |   .3856465   .1454579     2.65   0.008     .1005541    .6707388
ratio_tii_~d |   .4829107   .1451215     3.33   0.001     .1984777    .7673436
 top3_issuer |   .3580141   .1956456     1.83   0.067    -.0254443    .7414725
major_bran~x |   .3724265   .1711122     2.18   0.030     .0370528    .7078002
 numhold_000 |   .1603392   .1100696     1.46   0.145    -.0553934    .3760717
spread_ind~d |   .2649894   .0638175     4.15   0.000     .1399094    .3900694
       _cons |  -13.85208   1.677153    -8.26   0.000    -17.13924   -10.56492
------------------------------------------------------------------------------
Note: 5 failures and 0 successes completely determined.

. outreg2 using "`directory'/output/table_8.tex", append tex tstat e(r2_p)  lab
> el  dec(2) tdec(2) eqdrop(/) keep(*)
D:\Research\kpz_etfliquidity/output/table_8.tex
dir : seeout

. 
end of do-file
