
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       BE—Basic Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user network perpetual
Serial number: 501806221992
  Licensed to: Nathaniel Baum−Snow
               University of Toronto

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.

. do Table_2_code.do 

. 
. // Table 2 - Transient investors and ETF fees
. // -------------------------------------
. 
. // Load data
. // -------------------------------------
. clear all

. set more off

. 
. cd ..
/global/home/pc_mzoican/kpz_etfliquidity

. local directory : pwd

. display "`working_dir'"


. import delimited "`directory'/data_Marta/etf_panel_processed.csv"
(encoding automatically selected: ISO-8859-1)
(71 vars, 1,752 obs)

. 
. 
. // // Label variables
. // // ---------------------------------
. 
. egen time_existence_std=std(time_existence)

. egen time_since_first_std=std(time_since_first)
(55 missing values generated)

. egen log_aum_index_std=std(log_aum_index)

. egen lend_byaum_bps_std=std(lend_byaum_bps)

. egen marketing_fee_bps_std=std(marketing_fee_bps)

. egen tr_error_bps_std=std(tr_error_bps)

. egen perf_drag_bps_std=std(perf_drag_bps)

. egen turnover_frac_std=std(turnover_frac)
(2 missing values generated)

. egen other_expense_std=std(other_expenses)

. egen fee_waiver_std=std(fee_waivers)

. egen creation_fee_std=std(creation_fee)

. egen stock_tweets_std=std(stock_tweets)

. 
. label variable mgr_duration "Investor holding duration"

. label variable highfee "High MER"

. label variable time_existence_std "ETF age (quarters)"

. label variable time_since_first_std "Time since first position"

. label variable log_aum_index_std "Log index AUM"

. label variable d_uit "Unit investment trust"

. label variable lend_byaum_bps_std "Lending income (bps of AUM)"

. label variable marketing_fee_bps_std "Marketing expense (bps)"

. label variable stock_tweets "Name recognition (Twitter msg.)"

. label variable tr_error_bps_std "Tracking error (bps)"

. label variable perf_drag_bps_std "Performance drag (bps)"

. label variable turnover_frac_std "ETF turnover"

. label variable other_expense_std "Other expenses"

. label variable fee_waiver_std "Fee waivers"

. label variable creation_fee_std "Creation fee"

. label variable stock_tweets_std "Stock tweets"

. 
. 
. 
. //// REGRESSIONS FOR RATIO TRANSIENT - Marius's version 
> 
. //NOTE: standardised variables: log_aum_index_std lend_byaum_bps_std marketin
> g_fee_bps_std other_expense_std fee_waiver_std tr_error_bps_std 
. 
. //// -----------------------------------------
> 
. reghdfe ratio_tra highfee , absorb(index quarter) vce(cl index quarter)
(MWFE estimator converged in 5 iterations)
Warning: VCV matrix was non-positive semi-definite; adjustment from Cameron, Ge
> lbach & Miller applied.

HDFE Linear regression                            Number of obs   =      1,653
Absorbing 2 HDFE groups                           F(   1,     19) =       6.07
Statistics robust to heteroskedasticity           Prob > F        =     0.0235
                                                  R-squared       =     0.5432
                                                  Adj R-squared   =     0.5233
Number of clusters (index_id) =         49        Within R-sq.    =     0.0364
Number of clusters (quarter) =         20         Root MSE        =     0.1450

                      (Std. err. adjusted for 20 clusters in index_id quarter)
------------------------------------------------------------------------------
             |               Robust
   ratio_tra | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
     highfee |    .055529   .0225375     2.46   0.023     .0083574    .1027005
       _cons |    .193253   .0108221    17.86   0.000     .1706021    .2159038
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
    index_id |        49          49           0    *|
     quarter |        20          20           0    *|
-----------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. outreg2 using "`directory'\output\clientele_ratiotra.tex", adjr2 replace tex 
> tstat label  dec(2) tdec(2) eqdrop(/) keep(*)
/global/home/pc_mzoican/kpz_etfliquidity\output\clientele_ratiotra.tex
dir : seeout

. 
. reghdfe ratio_tra highfee stock_tweets_std log_aum_index_std lend_byaum_bps_s
> td marketing_fee_bps_std other_expense_std fee_waiver_std tr_error_bps_std pe
> rf_drag_bps_std d_uit time_existence_std time_since_first_std , absorb(index 
> quarter) vce(cl index quarter)
(MWFE estimator converged in 5 iterations)
Warning: VCV matrix was non-positive semi-definite; adjustment from Cameron, Ge
> lbach & Miller applied.
warning: missing F statistic; dropped variables due to collinearity or too few 
> clusters

HDFE Linear regression                            Number of obs   =      1,653
Absorbing 2 HDFE groups                           F(  12,     19) =          .
Statistics robust to heteroskedasticity           Prob > F        =          .
                                                  R-squared       =     0.5917
                                                  Adj R-squared   =     0.5709
Number of clusters (index_id) =         49        Within R-sq.    =     0.1386
Number of clusters (quarter) =         20         Root MSE        =     0.1375

                      (Std. err. adjusted for 20 clusters in index_id quarter)
------------------------------------------------------------------------------
             |               Robust
   ratio_tra | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
     highfee |   .0713092   .0235086     3.03   0.007     .0221051    .1205133
stock_twee~d |   .0049785   .0047668     1.04   0.309    -.0049986    .0149555
log_aum_in~d |  -.0782969   .0497128    -1.57   0.132    -.1823469    .0257531
lend_byaum~d |  -.0233306    .014841    -1.57   0.132    -.0543932    .0077321
marketing_~d |   .0387289    .015169     2.55   0.019     .0069798    .0704781
other_expe~d |   .0411462     .01688     2.44   0.025      .005816    .0764765
fee_waiver~d |   .0043347   .0123648     0.35   0.730    -.0215451    .0302144
tr_error_b~d |   .0011916   .0122593     0.10   0.924    -.0244674    .0268506
perf_drag_~d |  -.0018145   .0047909    -0.38   0.709     -.011842    .0082131
       d_uit |  -.0657921   .0695458    -0.95   0.356    -.2113532     .079769
time_exist~d |  -.0352118   .0208688    -1.69   0.108    -.0788906    .0084671
time_since~d |   .0717619   .0312444     2.30   0.033     .0063667    .1371571
       _cons |   .1877201   .0109847    17.09   0.000      .164729    .2107113
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
    index_id |        49          49           0    *|
     quarter |        20          20           0    *|
-----------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. outreg2 using "`directory'\output\clientele_ratiotra.tex", adjr2 append tex t
> stat label  dec(2) tdec(2) eqdrop(/) keep(*)
/global/home/pc_mzoican/kpz_etfliquidity\output\clientele_ratiotra.tex
dir : seeout

. 
. 
. reghdfe ratio_tra highfee stock_tweets_std log_aum_index_std , absorb(index q
> uarter) vce(cl index quarter)
(MWFE estimator converged in 5 iterations)
Warning: VCV matrix was non-positive semi-definite; adjustment from Cameron, Ge
> lbach & Miller applied.

HDFE Linear regression                            Number of obs   =      1,653
Absorbing 2 HDFE groups                           F(   3,     19) =      10.99
Statistics robust to heteroskedasticity           Prob > F        =     0.0002
                                                  R-squared       =     0.5468
                                                  Adj R-squared   =     0.5265
Number of clusters (index_id) =         49        Within R-sq.    =     0.0439
Number of clusters (quarter) =         20         Root MSE        =     0.1445

                      (Std. err. adjusted for 20 clusters in index_id quarter)
------------------------------------------------------------------------------
             |               Robust
   ratio_tra | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
     highfee |   .0548494   .0226915     2.42   0.026     .0073555    .1023433
stock_twee~d |   .0017415   .0018397     0.95   0.356    -.0021089     .005592
log_aum_in~d |  -.0832337   .0508804    -1.64   0.118    -.1897275    .0232602
       _cons |   .1942742   .0108184    17.96   0.000     .1716311    .2169174
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
    index_id |        49          49           0    *|
     quarter |        20          20           0    *|
-----------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. outreg2 using "`directory'\output\clientele_ratiotra.tex", adjr2 append tex t
> stat label  dec(2) tdec(2) eqdrop(/) keep(*)
/global/home/pc_mzoican/kpz_etfliquidity\output\clientele_ratiotra.tex
dir : seeout

. 
. reghdfe ratio_tra highfee stock_tweets_std log_aum_index_std lend_byaum_bps_s
> td marketing_fee_bps_std, absorb(index quarter) vce(cl index quarter)
(MWFE estimator converged in 5 iterations)
Warning: VCV matrix was non-positive semi-definite; adjustment from Cameron, Ge
> lbach & Miller applied.

HDFE Linear regression                            Number of obs   =      1,653
Absorbing 2 HDFE groups                           F(   5,     19) =      17.45
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5628
                                                  Adj R-squared   =     0.5426
Number of clusters (index_id) =         49        Within R-sq.    =     0.0775
Number of clusters (quarter) =         20         Root MSE        =     0.1420

                      (Std. err. adjusted for 20 clusters in index_id quarter)
------------------------------------------------------------------------------
             |               Robust
   ratio_tra | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
     highfee |   .0635405   .0211629     3.00   0.007      .019246     .107835
stock_twee~d |   .0011174   .0016697     0.67   0.511    -.0023773     .004612
log_aum_in~d |   -.087795   .0492929    -1.78   0.091    -.1909663    .0153763
lend_byaum~d |  -.0250036   .0127868    -1.96   0.065    -.0517667    .0017596
marketing_~d |   .0300546   .0156299     1.92   0.070    -.0026592    .0627684
       _cons |   .1901652   .0100443    18.93   0.000     .1691422    .2111882
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
    index_id |        49          49           0    *|
     quarter |        20          20           0    *|
-----------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. outreg2 using "`directory'\output\clientele_ratiotra.tex", adjr2 append tex t
> stat label  dec(2) tdec(2) eqdrop(/) keep(*)
/global/home/pc_mzoican/kpz_etfliquidity\output\clientele_ratiotra.tex
dir : seeout

. 
. reghdfe ratio_tra highfee stock_tweets_std log_aum_index_std lend_byaum_bps_s
> td marketing_fee_bps_std other_expense_std fee_waiver_std , absorb(index quar
> ter) vce(cl index quarter)
(MWFE estimator converged in 5 iterations)
Warning: VCV matrix was non-positive semi-definite; adjustment from Cameron, Ge
> lbach & Miller applied.
warning: missing F statistic; dropped variables due to collinearity or too few 
> clusters

HDFE Linear regression                            Number of obs   =      1,653
Absorbing 2 HDFE groups                           F(   7,     19) =          .
Statistics robust to heteroskedasticity           Prob > F        =          .
                                                  R-squared       =     0.5790
                                                  Adj R-squared   =     0.5590
Number of clusters (index_id) =         49        Within R-sq.    =     0.1119
Number of clusters (quarter) =         20         Root MSE        =     0.1394

                      (Std. err. adjusted for 20 clusters in index_id quarter)
------------------------------------------------------------------------------
             |               Robust
   ratio_tra | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
     highfee |   .0449899   .0201253     2.24   0.038     .0028672    .0871127
stock_twee~d |   .0003138   .0014931     0.21   0.836    -.0028113    .0034389
log_aum_in~d |  -.0948516   .0504734    -1.88   0.076    -.2004936    .0107904
lend_byaum~d |   -.019086   .0129453    -1.47   0.157    -.0461808    .0080088
marketing_~d |   .0232126   .0144405     1.61   0.124    -.0070117    .0534368
other_expe~d |    .042217   .0159534     2.65   0.016     .0088261    .0756079
fee_waiver~d |   .0006411    .011665     0.05   0.957    -.0237739    .0250562
       _cons |   .1996147   .0094675    21.08   0.000     .1797989    .2194305
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
    index_id |        49          49           0    *|
     quarter |        20          20           0    *|
-----------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. outreg2 using "`directory'\output\clientele_ratiotra.tex", adjr2 append tex t
> stat label  dec(2) tdec(2) eqdrop(/) keep(*)
/global/home/pc_mzoican/kpz_etfliquidity\output\clientele_ratiotra.tex
dir : seeout

. 
. reghdfe ratio_tra highfee stock_tweets_std log_aum_index_std lend_byaum_bps_s
> td marketing_fee_bps_std tr_error_bps_std perf_drag_bps_std d_uit time_existe
> nce_std time_since_first_std , absorb(index quarter) vce(cl index quarter)
(MWFE estimator converged in 5 iterations)
Warning: VCV matrix was non-positive semi-definite; adjustment from Cameron, Ge
> lbach & Miller applied.
warning: missing F statistic; dropped variables due to collinearity or too few 
> clusters

HDFE Linear regression                            Number of obs   =      1,653
Absorbing 2 HDFE groups                           F(  10,     19) =          .
Statistics robust to heteroskedasticity           Prob > F        =          .
                                                  R-squared       =     0.5786
                                                  Adj R-squared   =     0.5577
Number of clusters (index_id) =         49        Within R-sq.    =     0.1109
Number of clusters (quarter) =         20         Root MSE        =     0.1396

                      (Std. err. adjusted for 20 clusters in index_id quarter)
------------------------------------------------------------------------------
             |               Robust
   ratio_tra | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
     highfee |   .0920455   .0247754     3.72   0.001     .0401899    .1439011
stock_twee~d |    .001626   .0028474     0.57   0.575    -.0043337    .0075858
log_aum_in~d |  -.0691306   .0497517    -1.39   0.181    -.1732621     .035001
lend_byaum~d |  -.0270763   .0147997    -1.83   0.083    -.0580525    .0038998
marketing_~d |   .0456773   .0156967     2.91   0.009     .0128238    .0785308
tr_error_b~d |   .0056182   .0103623     0.54   0.594    -.0160703    .0273067
perf_drag_~d |   -.001996   .0047472    -0.42   0.679    -.0119321      .00794
       d_uit |    .008284   .0415623     0.20   0.844     -.078707    .0952749
time_exist~d |  -.0435606    .021257    -2.05   0.055    -.0880521    .0009309
time_since~d |   .0785053   .0315061     2.49   0.022     .0125624    .1444483
       _cons |   .1756025   .0114462    15.34   0.000     .1516452    .1995597
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
    index_id |        49          49           0    *|
     quarter |        20          20           0    *|
-----------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. outreg2 using "`directory'\output\clientele_ratiotra.tex", adjr2 append tex t
> stat label  dec(2) tdec(2) eqdrop(/) keep(*)
/global/home/pc_mzoican/kpz_etfliquidity\output\clientele_ratiotra.tex
dir : seeout

. 
. 
. 
. 
. 
. //// REGRESSIONS FOR RATIO TRANSIENT - Marta's version 
> 
. //NOTE: replace standardised variables (log_aum_index_std lend_byaum_bps_std 
> marketing_fee_bps_std other_expense_std fee_waiver_std tr_error_bps_std ) wit
> h non-standardised
. 
. //// -----------------------------------------
> 
. label variable mgr_duration "Investor holding duration"

. label variable highfee "High MER"

. label variable time_existence "ETF age (quarters)"

. label variable time_since_first "Time since first position"

. label variable log_aum_index "Log index AUM"

. label variable d_uit "Unit investment trust"

. label variable lend_byaum_bps "Lending income (bps of AUM)"

. label variable marketing_fee_bps "Marketing expense (bps)"

. label variable stock_tweets "Name recognition (Twitter msg.)"

. label variable tr_error_bps "Tracking error (bps)"

. label variable perf_drag_bps "Performance drag (bps)"

. label variable turnover_frac "ETF turnover"

. label variable other_expenses "Other expenses"

. label variable fee_waivers "Fee waivers"

. label variable creation_fee "Creation fee"

. 
. 
. 
. reghdfe ratio_tra highfee , absorb(index quarter) vce(cl index quarter)
(MWFE estimator converged in 5 iterations)
Warning: VCV matrix was non-positive semi-definite; adjustment from Cameron, Ge
> lbach & Miller applied.

HDFE Linear regression                            Number of obs   =      1,653
Absorbing 2 HDFE groups                           F(   1,     19) =       6.07
Statistics robust to heteroskedasticity           Prob > F        =     0.0235
                                                  R-squared       =     0.5432
                                                  Adj R-squared   =     0.5233
Number of clusters (index_id) =         49        Within R-sq.    =     0.0364
Number of clusters (quarter) =         20         Root MSE        =     0.1450

                      (Std. err. adjusted for 20 clusters in index_id quarter)
------------------------------------------------------------------------------
             |               Robust
   ratio_tra | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
     highfee |    .055529   .0225375     2.46   0.023     .0083574    .1027005
       _cons |    .193253   .0108221    17.86   0.000     .1706021    .2159038
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
    index_id |        49          49           0    *|
     quarter |        20          20           0    *|
-----------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. outreg2 using "`directory'\output\clientele_ratiotra2.tex", adjr2 replace tex
>  tstat label  dec(2) tdec(2) eqdrop(/) keep(*)
/global/home/pc_mzoican/kpz_etfliquidity\output\clientele_ratiotra2.tex
dir : seeout

. 
. reghdfe ratio_tra highfee stock_tweets log_aum_index lend_byaum_bps marketing
> _fee_bps other_expenses fee_waivers tr_error_bps perf_drag_bps d_uit time_exi
> stence time_since_first , absorb(index quarter) vce(cl index quarter)
(MWFE estimator converged in 5 iterations)
Warning: VCV matrix was non-positive semi-definite; adjustment from Cameron, Ge
> lbach & Miller applied.
warning: missing F statistic; dropped variables due to collinearity or too few 
> clusters

HDFE Linear regression                            Number of obs   =      1,653
Absorbing 2 HDFE groups                           F(  12,     19) =          .
Statistics robust to heteroskedasticity           Prob > F        =          .
                                                  R-squared       =     0.5917
                                                  Adj R-squared   =     0.5709
Number of clusters (index_id) =         49        Within R-sq.    =     0.1386
Number of clusters (quarter) =         20         Root MSE        =     0.1375

                      (Std. err. adjusted for 20 clusters in index_id quarter)
------------------------------------------------------------------------------
             |               Robust
   ratio_tra | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
     highfee |   .0713092    .023345     3.05   0.007     .0224476    .1201707
stock_tweets |   .0044336   .0042328     1.05   0.308    -.0044257    .0132929
log_aum_in~x |   -.053853   .0341929    -1.57   0.132    -.1254195    .0177135
lend_byaum~s |  -.0038408   .0024432    -1.57   0.132    -.0089546    .0012729
marketing_~s |   .0050059   .0019607     2.55   0.019     .0009022    .0091097
other_expe~s |   .8077995   .3313947     2.44   0.025     .1141825    1.501417
 fee_waivers |   .1655961   .4723676     0.35   0.730    -.8230808    1.154273
tr_error_bps |   .0000326   .0003354     0.10   0.924    -.0006693    .0007345
perf_drag_~s |  -.0002937   .0007755    -0.38   0.709    -.0019169    .0013295
       d_uit |  -.0657921   .0695476    -0.95   0.356    -.2113569    .0797728
time_exist~e |  -.0062996   .0037335    -1.69   0.108    -.0141139    .0015148
time_since~t |   .0811673   .0353394     2.30   0.033     .0072012    .1551335
       _cons |   1.387536   .7962674     1.74   0.098    -.2790711    3.054143
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
    index_id |        49          49           0    *|
     quarter |        20          20           0    *|
-----------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. outreg2 using "`directory'\output\clientele_ratiotra2.tex", adjr2 append tex 
> tstat label  dec(2) tdec(2) eqdrop(/) keep(*)
/global/home/pc_mzoican/kpz_etfliquidity\output\clientele_ratiotra2.tex
dir : seeout

. 
. 
. reghdfe ratio_tra highfee stock_tweets log_aum_index , absorb(index quarter) 
> vce(cl index quarter)
(MWFE estimator converged in 5 iterations)
Warning: VCV matrix was non-positive semi-definite; adjustment from Cameron, Ge
> lbach & Miller applied.

HDFE Linear regression                            Number of obs   =      1,653
Absorbing 2 HDFE groups                           F(   3,     19) =      11.09
Statistics robust to heteroskedasticity           Prob > F        =     0.0002
                                                  R-squared       =     0.5468
                                                  Adj R-squared   =     0.5265
Number of clusters (index_id) =         49        Within R-sq.    =     0.0439
Number of clusters (quarter) =         20         Root MSE        =     0.1445

                      (Std. err. adjusted for 20 clusters in index_id quarter)
------------------------------------------------------------------------------
             |               Robust
   ratio_tra | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
     highfee |   .0548494    .022512     2.44   0.025     .0077312    .1019676
stock_tweets |   .0015509   .0016353     0.95   0.355    -.0018717    .0049736
log_aum_in~x |  -.0572485    .034996    -1.64   0.118    -.1304958    .0159989
       _cons |   1.515131   .8063424     1.88   0.076     -.172563    3.202825
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
    index_id |        49          49           0    *|
     quarter |        20          20           0    *|
-----------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. outreg2 using "`directory'\output\clientele_ratiotra2.tex", adjr2 append tex 
> tstat label  dec(2) tdec(2) eqdrop(/) keep(*)
/global/home/pc_mzoican/kpz_etfliquidity\output\clientele_ratiotra2.tex
dir : seeout

. 
. reghdfe ratio_tra highfee stock_tweets log_aum_index lend_byaum_bps marketing
> _fee_bps, absorb(index quarter) vce(cl index quarter)
(MWFE estimator converged in 5 iterations)
Warning: VCV matrix was non-positive semi-definite; adjustment from Cameron, Ge
> lbach & Miller applied.

HDFE Linear regression                            Number of obs   =      1,653
Absorbing 2 HDFE groups                           F(   5,     19) =      17.84
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5628
                                                  Adj R-squared   =     0.5426
Number of clusters (index_id) =         49        Within R-sq.    =     0.0775
Number of clusters (quarter) =         20         Root MSE        =     0.1420

                      (Std. err. adjusted for 20 clusters in index_id quarter)
------------------------------------------------------------------------------
             |               Robust
   ratio_tra | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
     highfee |   .0635405   .0209715     3.03   0.007     .0196465    .1074344
stock_tweets |   .0009951    .001465     0.68   0.505    -.0020713    .0040614
log_aum_in~x |  -.0603858   .0339041    -1.78   0.091    -.1313479    .0105764
lend_byaum~s |  -.0041163   .0021051    -1.96   0.065    -.0085222    .0002897
marketing_~s |   .0038847   .0020203     1.92   0.070    -.0003437    .0081132
       _cons |   1.583556   .7800824     2.03   0.057    -.0491757    3.216287
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
    index_id |        49          49           0    *|
     quarter |        20          20           0    *|
-----------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. outreg2 using "`directory'\output\clientele_ratiotra2.tex", adjr2 append tex 
> tstat label  dec(2) tdec(2) eqdrop(/) keep(*)
/global/home/pc_mzoican/kpz_etfliquidity\output\clientele_ratiotra2.tex
dir : seeout

. 
. reghdfe ratio_tra highfee stock_tweets log_aum_index lend_byaum_bps marketing
> _fee_bps other_expenses fee_waivers , absorb(index quarter) vce(cl index quar
> ter)
(MWFE estimator converged in 5 iterations)
Warning: VCV matrix was non-positive semi-definite; adjustment from Cameron, Ge
> lbach & Miller applied.
warning: missing F statistic; dropped variables due to collinearity or too few 
> clusters

HDFE Linear regression                            Number of obs   =      1,653
Absorbing 2 HDFE groups                           F(   7,     19) =          .
Statistics robust to heteroskedasticity           Prob > F        =          .
                                                  R-squared       =     0.5790
                                                  Adj R-squared   =     0.5590
Number of clusters (index_id) =         49        Within R-sq.    =     0.1119
Number of clusters (quarter) =         20         Root MSE        =     0.1394

                      (Std. err. adjusted for 20 clusters in index_id quarter)
------------------------------------------------------------------------------
             |               Robust
   ratio_tra | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
     highfee |   .0449899   .0199286     2.26   0.036     .0032788    .0867011
stock_tweets |   .0002794   .0013089     0.21   0.833    -.0024601    .0030189
log_aum_in~x |  -.0652393    .034716    -1.88   0.076    -.1379008    .0074221
lend_byaum~s |  -.0031421   .0021311    -1.47   0.157    -.0076026    .0013185
marketing_~s |   .0030004   .0018665     1.61   0.124    -.0009063     .006907
other_expe~s |   .8288209   .3132039     2.65   0.016     .1732776    1.484364
 fee_waivers |   .0244925   .4456327     0.05   0.957    -.9082275    .9572124
       _cons |   1.678213   .7960018     2.11   0.049     .0121621    3.344264
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
    index_id |        49          49           0    *|
     quarter |        20          20           0    *|
-----------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. outreg2 using "`directory'\output\clientele_ratiotra2.tex", adjr2 append tex 
> tstat label  dec(2) tdec(2) eqdrop(/) keep(*)
/global/home/pc_mzoican/kpz_etfliquidity\output\clientele_ratiotra2.tex
dir : seeout

. 
. reghdfe ratio_tra highfee stock_tweets log_aum_index lend_byaum_bps marketing
> _fee_bps tr_error_bps perf_drag_bps d_uit time_existence time_since_first , a
> bsorb(index quarter) vce(cl index quarter)
(MWFE estimator converged in 5 iterations)
Warning: VCV matrix was non-positive semi-definite; adjustment from Cameron, Ge
> lbach & Miller applied.
warning: missing F statistic; dropped variables due to collinearity or too few 
> clusters

HDFE Linear regression                            Number of obs   =      1,653
Absorbing 2 HDFE groups                           F(  10,     19) =          .
Statistics robust to heteroskedasticity           Prob > F        =          .
                                                  R-squared       =     0.5786
                                                  Adj R-squared   =     0.5577
Number of clusters (index_id) =         49        Within R-sq.    =     0.1109
Number of clusters (quarter) =         20         Root MSE        =     0.1396

                      (Std. err. adjusted for 20 clusters in index_id quarter)
------------------------------------------------------------------------------
             |               Robust
   ratio_tra | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
     highfee |   .0920455    .024615     3.74   0.001     .0405257    .1435652
stock_tweets |   .0014481   .0025182     0.58   0.572    -.0038226    .0067188
log_aum_in~x |  -.0475483   .0342197    -1.39   0.181    -.1191709    .0240743
lend_byaum~s |  -.0044575   .0024364    -1.83   0.083     -.009557     .000642
marketing_~s |   .0059041   .0020289     2.91   0.009     .0016576    .0101506
tr_error_bps |   .0001537   .0002835     0.54   0.594    -.0004396     .000747
perf_drag_~s |  -.0003231   .0007684    -0.42   0.679    -.0019315    .0012853
       d_uit |    .008284   .0415628     0.20   0.844    -.0787079    .0952758
time_exist~e |  -.0077932    .003803    -2.05   0.055    -.0157529    .0001665
time_since~t |   .0887946   .0356354     2.49   0.022     .0142088    .1633804
       _cons |   1.261885    .796562     1.58   0.130    -.4053385    2.929108
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
    index_id |        49          49           0    *|
     quarter |        20          20           0    *|
-----------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. outreg2 using "`directory'\output\clientele_ratiotra2.tex", adjr2 append tex 
> tstat label  dec(2) tdec(2) eqdrop(/) keep(*)
/global/home/pc_mzoican/kpz_etfliquidity\output\clientele_ratiotra2.tex
dir : seeout

. 
. 
. 
. //// REGRESSIONS FOR RATIO TRANSIENT - Talis's version 
> 
. //NOTE1: replace standardised variables (log_aum_index_std lend_byaum_bps_std
>  marketing_fee_bps_std other_expense_std fee_waiver_std tr_error_bps_std ) wi
> th non-standardised
. //NOTE2: use different code: Example: reghdfe ln_wage age i.race, absorb(temp
> ) cluster(idcode year)
. 
. //// -----------------------------------------
> 
. 
. 
. reghdfe ratio_tra highfee, absorb(index quarter) cluster(index quarter)
(MWFE estimator converged in 5 iterations)
Warning: VCV matrix was non-positive semi-definite; adjustment from Cameron, Ge
> lbach & Miller applied.

HDFE Linear regression                            Number of obs   =      1,653
Absorbing 2 HDFE groups                           F(   1,     19) =       6.07
Statistics robust to heteroskedasticity           Prob > F        =     0.0235
                                                  R-squared       =     0.5432
                                                  Adj R-squared   =     0.5233
Number of clusters (index_id) =         49        Within R-sq.    =     0.0364
Number of clusters (quarter) =         20         Root MSE        =     0.1450

                      (Std. err. adjusted for 20 clusters in index_id quarter)
------------------------------------------------------------------------------
             |               Robust
   ratio_tra | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
     highfee |    .055529   .0225375     2.46   0.023     .0083574    .1027005
       _cons |    .193253   .0108221    17.86   0.000     .1706021    .2159038
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
    index_id |        49          49           0    *|
     quarter |        20          20           0    *|
-----------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. outreg2 using "`directory'\output\clientele_ratiotra3.tex", adjr2 replace tex
>  tstat label  dec(2) tdec(2) eqdrop(/) keep(*)
/global/home/pc_mzoican/kpz_etfliquidity\output\clientele_ratiotra3.tex
dir : seeout

. 
. reghdfe ratio_tra highfee stock_tweets log_aum_index lend_byaum_bps marketing
> _fee_bps other_expenses fee_waivers tr_error_bps perf_drag_bps d_uit time_exi
> stence time_since_first , absorb(index quarter) cluster(index quarter)
(MWFE estimator converged in 5 iterations)
Warning: VCV matrix was non-positive semi-definite; adjustment from Cameron, Ge
> lbach & Miller applied.
warning: missing F statistic; dropped variables due to collinearity or too few 
> clusters

HDFE Linear regression                            Number of obs   =      1,653
Absorbing 2 HDFE groups                           F(  12,     19) =          .
Statistics robust to heteroskedasticity           Prob > F        =          .
                                                  R-squared       =     0.5917
                                                  Adj R-squared   =     0.5709
Number of clusters (index_id) =         49        Within R-sq.    =     0.1386
Number of clusters (quarter) =         20         Root MSE        =     0.1375

                      (Std. err. adjusted for 20 clusters in index_id quarter)
------------------------------------------------------------------------------
             |               Robust
   ratio_tra | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
     highfee |   .0713092    .023345     3.05   0.007     .0224476    .1201707
stock_tweets |   .0044336   .0042328     1.05   0.308    -.0044257    .0132929
log_aum_in~x |   -.053853   .0341929    -1.57   0.132    -.1254195    .0177135
lend_byaum~s |  -.0038408   .0024432    -1.57   0.132    -.0089546    .0012729
marketing_~s |   .0050059   .0019607     2.55   0.019     .0009022    .0091097
other_expe~s |   .8077995   .3313947     2.44   0.025     .1141825    1.501417
 fee_waivers |   .1655961   .4723676     0.35   0.730    -.8230808    1.154273
tr_error_bps |   .0000326   .0003354     0.10   0.924    -.0006693    .0007345
perf_drag_~s |  -.0002937   .0007755    -0.38   0.709    -.0019169    .0013295
       d_uit |  -.0657921   .0695476    -0.95   0.356    -.2113569    .0797728
time_exist~e |  -.0062996   .0037335    -1.69   0.108    -.0141139    .0015148
time_since~t |   .0811673   .0353394     2.30   0.033     .0072012    .1551335
       _cons |   1.387536   .7962674     1.74   0.098    -.2790711    3.054143
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
    index_id |        49          49           0    *|
     quarter |        20          20           0    *|
-----------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. outreg2 using "`directory'\output\clientele_ratiotra3.tex", adjr2 append tex 
> tstat label  dec(2) tdec(2) eqdrop(/) keep(*)
/global/home/pc_mzoican/kpz_etfliquidity\output\clientele_ratiotra3.tex
dir : seeout

. 
. 
. reghdfe ratio_tra highfee stock_tweets log_aum_index , absorb(index quarter) 
> cluster(index quarter)
(MWFE estimator converged in 5 iterations)
Warning: VCV matrix was non-positive semi-definite; adjustment from Cameron, Ge
> lbach & Miller applied.

HDFE Linear regression                            Number of obs   =      1,653
Absorbing 2 HDFE groups                           F(   3,     19) =      11.09
Statistics robust to heteroskedasticity           Prob > F        =     0.0002
                                                  R-squared       =     0.5468
                                                  Adj R-squared   =     0.5265
Number of clusters (index_id) =         49        Within R-sq.    =     0.0439
Number of clusters (quarter) =         20         Root MSE        =     0.1445

                      (Std. err. adjusted for 20 clusters in index_id quarter)
------------------------------------------------------------------------------
             |               Robust
   ratio_tra | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
     highfee |   .0548494    .022512     2.44   0.025     .0077312    .1019676
stock_tweets |   .0015509   .0016353     0.95   0.355    -.0018717    .0049736
log_aum_in~x |  -.0572485    .034996    -1.64   0.118    -.1304958    .0159989
       _cons |   1.515131   .8063424     1.88   0.076     -.172563    3.202825
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
    index_id |        49          49           0    *|
     quarter |        20          20           0    *|
-----------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. outreg2 using "`directory'\output\clientele_ratiotra3.tex", adjr2 append tex 
> tstat label  dec(2) tdec(2) eqdrop(/) keep(*)
/global/home/pc_mzoican/kpz_etfliquidity\output\clientele_ratiotra3.tex
dir : seeout

. 
. reghdfe ratio_tra highfee stock_tweets log_aum_index lend_byaum_bps marketing
> _fee_bps, absorb(index quarter) cluster(index quarter)
(MWFE estimator converged in 5 iterations)
Warning: VCV matrix was non-positive semi-definite; adjustment from Cameron, Ge
> lbach & Miller applied.

HDFE Linear regression                            Number of obs   =      1,653
Absorbing 2 HDFE groups                           F(   5,     19) =      17.84
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5628
                                                  Adj R-squared   =     0.5426
Number of clusters (index_id) =         49        Within R-sq.    =     0.0775
Number of clusters (quarter) =         20         Root MSE        =     0.1420

                      (Std. err. adjusted for 20 clusters in index_id quarter)
------------------------------------------------------------------------------
             |               Robust
   ratio_tra | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
     highfee |   .0635405   .0209715     3.03   0.007     .0196465    .1074344
stock_tweets |   .0009951    .001465     0.68   0.505    -.0020713    .0040614
log_aum_in~x |  -.0603858   .0339041    -1.78   0.091    -.1313479    .0105764
lend_byaum~s |  -.0041163   .0021051    -1.96   0.065    -.0085222    .0002897
marketing_~s |   .0038847   .0020203     1.92   0.070    -.0003437    .0081132
       _cons |   1.583556   .7800824     2.03   0.057    -.0491757    3.216287
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
    index_id |        49          49           0    *|
     quarter |        20          20           0    *|
-----------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. outreg2 using "`directory'\output\clientele_ratiotra3.tex", adjr2 append tex 
> tstat label  dec(2) tdec(2) eqdrop(/) keep(*)
/global/home/pc_mzoican/kpz_etfliquidity\output\clientele_ratiotra3.tex
dir : seeout

. 
. reghdfe ratio_tra highfee stock_tweets log_aum_index lend_byaum_bps marketing
> _fee_bps other_expenses fee_waivers , absorb(index quarter) cluster(index qua
> rter)
(MWFE estimator converged in 5 iterations)
Warning: VCV matrix was non-positive semi-definite; adjustment from Cameron, Ge
> lbach & Miller applied.
warning: missing F statistic; dropped variables due to collinearity or too few 
> clusters

HDFE Linear regression                            Number of obs   =      1,653
Absorbing 2 HDFE groups                           F(   7,     19) =          .
Statistics robust to heteroskedasticity           Prob > F        =          .
                                                  R-squared       =     0.5790
                                                  Adj R-squared   =     0.5590
Number of clusters (index_id) =         49        Within R-sq.    =     0.1119
Number of clusters (quarter) =         20         Root MSE        =     0.1394

                      (Std. err. adjusted for 20 clusters in index_id quarter)
------------------------------------------------------------------------------
             |               Robust
   ratio_tra | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
     highfee |   .0449899   .0199286     2.26   0.036     .0032788    .0867011
stock_tweets |   .0002794   .0013089     0.21   0.833    -.0024601    .0030189
log_aum_in~x |  -.0652393    .034716    -1.88   0.076    -.1379008    .0074221
lend_byaum~s |  -.0031421   .0021311    -1.47   0.157    -.0076026    .0013185
marketing_~s |   .0030004   .0018665     1.61   0.124    -.0009063     .006907
other_expe~s |   .8288209   .3132039     2.65   0.016     .1732776    1.484364
 fee_waivers |   .0244925   .4456327     0.05   0.957    -.9082275    .9572124
       _cons |   1.678213   .7960018     2.11   0.049     .0121621    3.344264
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
    index_id |        49          49           0    *|
     quarter |        20          20           0    *|
-----------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. outreg2 using "`directory'\output\clientele_ratiotra3.tex", adjr2 append tex 
> tstat label  dec(2) tdec(2) eqdrop(/) keep(*)
/global/home/pc_mzoican/kpz_etfliquidity\output\clientele_ratiotra3.tex
dir : seeout

. 
. reghdfe ratio_tra highfee stock_tweets log_aum_index lend_byaum_bps marketing
> _fee_bps tr_error_bps perf_drag_bps d_uit time_existence time_since_first , a
> bsorb(index quarter) cluster(index quarter)
(MWFE estimator converged in 5 iterations)
Warning: VCV matrix was non-positive semi-definite; adjustment from Cameron, Ge
> lbach & Miller applied.
warning: missing F statistic; dropped variables due to collinearity or too few 
> clusters

HDFE Linear regression                            Number of obs   =      1,653
Absorbing 2 HDFE groups                           F(  10,     19) =          .
Statistics robust to heteroskedasticity           Prob > F        =          .
                                                  R-squared       =     0.5786
                                                  Adj R-squared   =     0.5577
Number of clusters (index_id) =         49        Within R-sq.    =     0.1109
Number of clusters (quarter) =         20         Root MSE        =     0.1396

                      (Std. err. adjusted for 20 clusters in index_id quarter)
------------------------------------------------------------------------------
             |               Robust
   ratio_tra | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
     highfee |   .0920455    .024615     3.74   0.001     .0405257    .1435652
stock_tweets |   .0014481   .0025182     0.58   0.572    -.0038226    .0067188
log_aum_in~x |  -.0475483   .0342197    -1.39   0.181    -.1191709    .0240743
lend_byaum~s |  -.0044575   .0024364    -1.83   0.083     -.009557     .000642
marketing_~s |   .0059041   .0020289     2.91   0.009     .0016576    .0101506
tr_error_bps |   .0001537   .0002835     0.54   0.594    -.0004396     .000747
perf_drag_~s |  -.0003231   .0007684    -0.42   0.679    -.0019315    .0012853
       d_uit |    .008284   .0415628     0.20   0.844    -.0787079    .0952758
time_exist~e |  -.0077932    .003803    -2.05   0.055    -.0157529    .0001665
time_since~t |   .0887946   .0356354     2.49   0.022     .0142088    .1633804
       _cons |   1.261885    .796562     1.58   0.130    -.4053385    2.929108
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
    index_id |        49          49           0    *|
     quarter |        20          20           0    *|
-----------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. outreg2 using "`directory'\output\clientele_ratiotra3.tex", adjr2 append tex 
> tstat label  dec(2) tdec(2) eqdrop(/) keep(*)
/global/home/pc_mzoican/kpz_etfliquidity\output\clientele_ratiotra3.tex
dir : seeout

. 
. 
. 
end of do-file
